In [16]:
import numpy as np
import pandas as pd

s1 = pd.Series([0,1], index=['a','b'])
display(s1)
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
display(s2)
s3 = pd.Series([5, 6], index=['f', 'g'])
display(s3)

a    0
b    1
dtype: int64

c    2
d    3
e    4
dtype: int64

f    5
g    6
dtype: int64

In [17]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [18]:
pd.concat([s1,s2,s3],axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [19]:
pd.concat([s1, s2, s3], keys=['one', 'two', 'three'])

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [20]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])
display(df1)
display(df2)

          a         b         c         d
0 -0.036127 -0.120893  1.637747 -1.358331
1  0.953500 -0.434563 -0.458845 -0.676160
2 -0.985070  0.360561 -0.149389 -0.909530

          b         d         a
0  1.344695  0.596892 -0.614209
1  0.939842  0.363531  0.249646

In [21]:
#default axis = 0依照列去組合在一起
pd.concat([df1,df2])

          a         b         c         d
0 -0.036127 -0.120893  1.637747 -1.358331
1  0.953500 -0.434563 -0.458845 -0.676160
2 -0.985070  0.360561 -0.149389 -0.909530
0 -0.614209  1.344695       NaN  0.596892
1  0.249646  0.939842       NaN  0.363531

In [22]:
pd.concat([df1,df2],axis=1)

          a         b         c         d         b         d         a
0 -0.036127 -0.120893  1.637747 -1.358331  1.344695  0.596892 -0.614209
1  0.953500 -0.434563 -0.458845 -0.676160  0.939842  0.363531  0.249646
2 -0.985070  0.360561 -0.149389 -0.909530       NaN       NaN       NaN

In [23]:
pd.concat([df1,df2],keys=['10-1','10-2'])

               a         b         c         d
10-1 0 -0.036127 -0.120893  1.637747 -1.358331
     1  0.953500 -0.434563 -0.458845 -0.676160
     2 -0.985070  0.360561 -0.149389 -0.909530
10-2 0 -0.614209  1.344695       NaN  0.596892
     1  0.249646  0.939842       NaN  0.363531

In [24]:
pd.concat([df1,df2],ignore_index=True)#ignore_index排除索引

          a         b         c         d
0 -0.036127 -0.120893  1.637747 -1.358331
1  0.953500 -0.434563 -0.458845 -0.676160
2 -0.985070  0.360561 -0.149389 -0.909530
3 -0.614209  1.344695       NaN  0.596892
4  0.249646  0.939842       NaN  0.363531

In [25]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2),
                   index=['a', 'b', 'c'],
                   columns=['one','two'])
display(df1)
df2 = pd.DataFrame(np.arange(4).reshape(2, 2),
                   index=['a', 'c'],
                   columns=['three','four'])
display(df2)

   one  two
a    0    1
b    2    3
c    4    5

   three  four
a      0     1
c      2     3

In [26]:
pd.concat([df1,df2],axis=1,keys=['level1','level2'])

  level1     level2
     one two  three four
a      0   1    0.0  1.0
b      2   3    NaN  NaN
c      4   5    2.0  3.0